{
  "title": "Hola, {{name}} aquí!!! Bienvenido y dejáme contar lo que pasa.",
  "presentation": "Como puede ver, esta es una versión Beta. Eso porque todavía hay muchas funcionalidades que pretendo implementar aquí. Mientras tanto, puede conferir las siguientes secciones:",
  "welcome_items": [
    {
      "section": "Proyectos",
      "label": "Mis repositorios de GitHub. Si está estudiando programación, data science y/o statistical learning / machine learning, hay un montón de contenido inspirarse.",
      "path": "/projects",
      "icon": "code"
    },
    {
      "section": "Artículos",
      "label": "Posts que escribí relacionados a cybersecurity, código abierto (open source), productividad y desarrollo. (Solo en portugués por enquanto)",
      "path": "/articles",
      "icon": "chrome_reader_mode"
    },
    {
      "section": "Playground",
      "label": "Algunos widgets chévere que implementé para darle ideas y divertirse.",
      "path": "/playground",
      "icon": "videogame_asset"
    },
    {
      "section": "Contact",
      "label": "Si quiere contactarme para trabajar juntos o con preguntas / sugeréncias or with questions / suggestions, siéntase libre para llenar el formulario de contacto. También me encontrará en las plataformas de mídia social:",
      "path": "/contact",
      "icon": "mail"
    }
  ],
  "coming_soon": {
    "title": "Proximamente",
    "desc": "Y que funcionalidades pretendo tener aquí en el futuro? Aquí están algunas:",
    "soon_items": [
      {
        "section": "API",
        "label": "Implementar un api web para automatizar la búsqueda por mis repositorios de GitHub y posibilitar la creación de otros widgets que necesitan un servidor de back-end para funcionar mejor.",
        "icon": "https"
      },
      {
        "section": "Videos",
        "label": "Crear una sección de Videos con tutoriales / cursos de programación.",
        "icon": "video_library"
      },
      {
        "section": "Artículos traducidos",
        "label": "Traduciré mis artículos para el inglés y español, pero antes estoy pensando en hospedar mi propio blog en vez de postear en Dev, de esa manera tengo más flexibilidad.",
        "icon": "language"
      },
      {
        "section": "Logo",
        "label": "Quiero crear un logo bacano! Ideas?",
        "icon": "brush"
      },
      {
        "section": "Además",
        "label": "Tengo muchas ideas, pero ya veremos cuando lleguemos allí.",
        "icon": "more_horiz"
      }
    ]
  },
  "about": "A propósito, este proyecto es público en GitHub. Haga un fork!!!"
}
