{
  "title": "Olá, {{name}} aqui!!! Bem-vindo e deixa eu te contar sobre isso aqui.",
  "presentation": "Como você pode ver, esta é uma versão Beta. Isso porque, ainda tem muitas funcionalidades que eu pretendo implmentar. Por ora, você pode conferir as seguintes seções:",
  "welcome_items": [
    {
      "section": "Projetos",
      "label": "Meus repositórios do GitHub. Se você está aprendendo programação, data science e/ou statistical learning / machine learning, tem um monte de conteúdo para te inspirar.",
      "path": "/projects",
      "icon": "code"
    },
    {
      "section": "Artigos",
      "label": "Post que escrevi sobre cybersecurity, código aberto (open source), produtividade e desenvolvimento. (Apenas em portugês por enquanto)",
      "path": "/articles",
      "icon": "chrome_reader_mode"
    },
    {
      "section": "Playground",
      "label": "Alguns widgets legais que eu implementei para te dar ideias e se divertir.",
      "path": "/playground",
      "icon": "videogame_asset"
    },
    {
      "section": "Contato",
      "label": "Se você gostaria de entrar em contato para trabalhar junto, ou com perguntas / sugestões, sinta-se a vontade para preencher o formulário de contato. Você também pode me achar através das plataformas de mídia social:",
      "path": "/contact",
      "icon": "mail"
    }
  ],
  "coming_soon": {
    "title": "Em breve",
    "desc": "E que funcionalidades eu pretendo ter aqui no futuro? Aqui são algumas:",
    "soon_items": [
      {
        "section": "API",
        "label": "Implementar um api web para automatizar a busca de repositórios do GitHub e permitir a implementação de outros widgets que precisam de um servidor de back-end para funcionar melhor.",
        "icon": "https"
      },
      {
        "section": "Videos",
        "label": "Criar uma seção de Videos com tutoriais / cursos de programação.",
        "icon": "video_library"
      },
      {
        "section": "Artigos traduzidos",
        "label": "Eu irei traduzir meus artigos para inglês e espanhol, mas primeiro eu estou pensando em hospedar meu próprio blog ao invés de postar em Dev, dessa forma eu tenho mais flexibilidade.",
        "icon": "language"
      },
      {
        "section": "Logo",
        "label": "Eu quero criar um logo bacana! Ideias?",
        "icon": "brush"
      },
      {
        "section": "Depois disso",
        "label": "Eu tenho muitas ideias, mas veremos quando chegarmos lá.",
        "icon": "more_horiz"
      }
    ]
  },
  "about": "A propósito, Este porjeto é público no GitHub. Faça um fork!!!"
}
